Ran Plan for 2 projects:

1. project: `bucket` dir: `bucket` workspace: `default`
1. project: `seed` dir: `seed` workspace: `default`

### 1. project: `bucket` dir: `bucket` workspace: `default`
```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p bucket`
* :put_litter_in_its_place: To **delete** this plan click [here](http://089fb7783516:4141/lock?id=dmalicia%252Fdm-terraform%252Fbucket%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p bucket`

---
### 2. project: `seed` dir: `seed` workspace: `default`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.seed001 must be replaced
-/+ resource "google_compute_instance" "seed001" {
        can_ip_forward          = false
      ~ cpu_platform            = "Intel Broadwell" -> (known after apply)
      ~ current_status          = "RUNNING" -> (known after apply)
        deletion_protection     = false
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/heroic-muse-289316/zones/us-west1-a/instances/dmalicia-vm-6e291ed314bc831a" -> (known after apply)
      ~ instance_id             = "5783492960268628437" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
        machine_type            = "f1-micro"
        metadata                = {
            "ssh-keys" = <<~EOT
                dmalicia:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCobuzwfxuNnlZUgmPqHdSLj6+s6giPOfCCfi2UjHpuzMr5/cRS0HxZBem2A0cyNcbPiG+WIsnd+jocrqE+WlaioLZwXWPbQ4OAYeZb0yibfks/jG6GMszyyN1qg2davPogsTPlwFQubnWb1HTZiz2K58OcKETuv3mJLGqZsRsIai/Trvx7TLax5YHnVYTdM8fEfGCiByWjpU2g+cpPHe2qcSWjoMm9ThMW/jZ5Xc68HnSdap4X37SaP29SRN3AqA464efYMgZzEuIe0aHFwA9pkwXCS+NDWZx8VTRSJIkpvLzpjzrLrBFh/w6ECZlwHXI4KcP28B92otcfM+Tot+wzWxEitT22VaRBNrXwwExxqC4IC4ZxL5pxxpydy04GsraShjgcA3hxEh1YJl4BZud3Na9KtdimQ7CPzgKwsHaPTtb1QCWDdCsoDW5PW7Cz4029CruVwP13Mkm8sK0ja59m7uH8lpIi2SVMnOS6YkZfxN7/9IVHgNDnd4OYi2HR84hVTs6578HFhft3jdE6j5TVyQLXK/PLxZJKlXO7EkIGvytjW+1XOeGFywB7l9l2G4aSAN1CBertde4J8vyPwv0SqWW684TuoGj5hxfFU3XoQpFlDbN2QH2fm3oExMxzfFMRTM6cyJa410/w6lZswsWC1Wonf6juVw1P3RSY0uDEcw== root@sandworm
            EOT
        }
      ~ metadata_fingerprint    = "6ttqISmZyIs=" -> (known after apply)
        metadata_startup_script = <<~EOT
            sudo apt-get update; 
            sudo apt-get install -yq build-essential python-pip rsync software-properties-common apt-transport-https; 
            curl -fsSL https://download.docker.com/linux/debian/gpg | sudo apt-key add -; 
            A=`lsb_release -cs`;
            echo "fim" >> /tmp/meio;
            sudo add-apt-repository "deb [arch=amd64] https://download.docker.com/linux/debian $A stable";
            sleep 3
            sudo apt-get update
            sudo apt-get -yq install docker-ce docker-ce-cli containerd.io;
            echo "apt docker" >> /tmp/meio;
            sudo docker pull consul; 
            sudo docker images -f 'reference=consul'
            docker run -d -p 8300:8300 -p 8302:8302 -p 8301:8301 -p 8500:8500 -p 8600:8600/udp --name=badger3 consul agent -server -ui -node=server-1 -bootstrap-expect=1 -client=0.0.0.0
            echo "fim" >> /tmp/eco
        EOT
      + min_cpu_platform        = (known after apply)
      ~ name                    = "dmalicia-vm-6e291ed314bc831a" -> "dmus-seed001-6e291ed314bc831a" # forces replacement
      ~ project                 = "heroic-muse-289316" -> (known after apply)
      - resource_policies       = [] -> null
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west1-a/instances/dmalicia-vm-6e291ed314bc831a" -> (known after apply)
      - tags                    = [] -> null
      ~ tags_fingerprint        = "42WmSpB8rSM=" -> (known after apply)
        zone                    = "us-west1-a"

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west1-a/disks/dmalicia-vm-6e291ed314bc831a" -> (known after apply)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-9-stretch-v20200910" -> "debian-cloud/debian-9"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/networks/default" -> "default"
          ~ network_ip         = "10.138.0.20" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/us-west1/subnetworks/default" -> (known after apply)
          ~ subnetwork_project = "heroic-muse-289316" -> (known after apply)

          ~ access_config {
                nat_ip       = "35.233.219.1"
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p seed`
* :put_litter_in_its_place: To **delete** this plan click [here](http://089fb7783516:4141/lock?id=dmalicia%252Fdm-terraform%252Fseed%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p seed`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
